#Написати програму в якій випадковим чином створюється число в діапазоні від 1 до 10.
#Користувач намагається вгадати число. Програма може давати підказки тільки "More", "Less", "You won!"
import random


number = random.randint(1, 10)

print("Програма створила число від 1 до 10. Відгадайте його!")

while True:

    number_guess = int(input("Введіть своє припущення:"))

    if number_guess < number:
        print("More")
    elif number_guess > number:
        print("Less")
    else:
        print("You won!")
        break
######################################################################

#Написати програму в якій випадковим чином створюється число в діапазоні від 1 до 12.
#Програма виводить на екран число, яке створено і назву місяця, який відповідає цьому числу.
import random

Months = [
    "January", "February", "March", "April", "May", "June",
    "July", "August", "September", "October", "November", "December"
         ]
Month_num = random.randint(1, 12)
Month_name = Months[Month_num - 1]
print(f"{Month_num} - {Month_name}")

######################################################################

#Написати програму в якій користувач вводить два цілих числа.
#Програма виводить результат піднесення першого числа у степінь відповідний другому числу.
#Зробити обробку всіх можливих помилок.
#В разі неможливості виконання дії - вивести відповідне повідомлення. ("Введено не число", тощо ... )
while True:
    try:
        number1 = int(input("Введіть перше ціле число: "))
        number2 = int(input("Введіть цілу степінь: "))

        result = number1 ** number2
        print("Результат:", result)
        break
    except ValueError:
        print("Введено не число. Будь ласка, введіть ціле число")
    except OverflowError:
        print("Число надто велике для обчислення.")
